uhnp/src/InformationRegisters/ИменаФайловИКаталогов/ИменаФайловИКаталогов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ИменаФайловИКаталогов</name>
  <resources>
    <name>Имя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>УдалитьОбъект</name>
    <type>
      <types>CatalogRef.Валюты</types>
      <types>CatalogRef.Организации</types>
      <types>Boolean</types>
      <types>CatalogRef.Субконто</types>
      <types>String</types>
      <types>Date</types>
      <types>Number</types>
      <types>CatalogRef.Периоды</types>
      <types>CatalogRef.Сценарии</types>
      <types>CatalogRef.ВидыОтчетов</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ТипОбъекта</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.ВидыСубконтоКорпоративные</types>
      <types>EnumRef.ТипыОбъектов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Объект</name>
    <type>
      <types>CatalogRef.ДокументыБД</types>
      <types>CatalogRef.Валюты</types>
      <types>CatalogRef.Организации</types>
      <types>Boolean</types>
      <types>CatalogRef.ПроизвольныйКлассификаторУХ</types>
      <types>CatalogRef.ПакетыПравилИмпортаТаблиц</types>
      <types>String</types>
      <types>Date</types>
      <types>Number</types>
      <types>CatalogRef.ПравилаЗаполненияОбъектовБД</types>
      <types>CatalogRef.Проекты</types>
      <types>CatalogRef.Периоды</types>
      <types>CatalogRef.Сценарии</types>
      <types>CatalogRef.ВидыОтчетов</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>РежимКорректировки</name>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
  <dimensions>
    <name>УдалитьИмя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

uhnp/src/Enums/ТипыОбъектов/ТипыОбъектов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыОбъектов</name>
  <enumValues>
    <name>ПериодСценария</name>
  </enumValues>
  <enumValues>
    <name>Сценарий</name>
  </enumValues>
  <enumValues>
    <name>Организация</name>
  </enumValues>
  <enumValues>
    <name>Проект</name>
  </enumValues>
  <enumValues>
    <name>ВидОтчета</name>
  </enumValues>
  <enumValues>
    <name>Аналитика1</name>
  </enumValues>
  <enumValues>
    <name>Аналитика2</name>
  </enumValues>
  <enumValues>
    <name>Аналитика3</name>
  </enumValues>
  <enumValues>
    <name>Аналитика4</name>
  </enumValues>
  <enumValues>
    <name>Аналитика5</name>
  </enumValues>
  <enumValues>
    <name>Аналитика6</name>
  </enumValues>
  <enumValues>
    <name>ДокументПараллельногоУчета</name>
  </enumValues>
</mdclass:Enum>

uhnp/src/InformationRegisters/ИменаФайловИКаталогов/Forms/ФормаСпискаУправляемая/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ТипыЗначений = Новый Структура("Страница_Период, Страница_Сценарий, Страница_Организация , Страница_Проект, Страница_ВидОтчета,СтраницаДокументы"
	  , Перечисления.ТипыОбъектов.ПериодСценария
	  , Перечисления.ТипыОбъектов.Сценарий
	  , Перечисления.ТипыОбъектов.Организация
	  , Перечисления.ТипыОбъектов.Проект
	  , Перечисления.ТипыОбъектов.ВидОтчета
	  , Перечисления.ТипыОбъектов.ДокументПараллельногоУчета);
	
	СоответствиеСписков=Новый Соответствие;
	СоответствиеСписков.Вставить(Перечисления.ТипыОбъектов.ВидОтчета,					"Список_ВидОтчета");
	СоответствиеСписков.Вставить(Перечисления.ТипыОбъектов.ДокументПараллельногоУчета,	"Список_Документы");
	СоответствиеСписков.Вставить(Перечисления.ТипыОбъектов.Организация,					"Список_Организация");
	СоответствиеСписков.Вставить(Перечисления.ТипыОбъектов.Проект,						"Список_Проект");
	СоответствиеСписков.Вставить(Перечисления.ТипыОбъектов.ПериодСценария,				"Список_Период");
	СоответствиеСписков.Вставить(Перечисления.ТипыОбъектов.Сценарий,					"Список_Сценарий");
	
	Для Индекс=1 По ПараметрыСеанса.ЧислоДопАналитик Цикл
		
		СоответствиеСписков.Вставить(Перечисления.ТипыОбъектов["Аналитика"+Индекс],	"Список_Аналитики");
		
	КонецЦикла;
	
	СоответствиеСписковОбъектам=Новый ФиксированноеСоответствие(СоответствиеСписков);
	
	УстановитьОтборПоВидуСубконто();
	
КонецПроцедуры

&НаКлиенте
Процедура СписокОрганизацияПередНачаломИзменения(Элемент, Отказ)
	
	
	
КонецПроцедуры

&НаСервере
Процедура УстановитьОтборПоВидуСубконто()
	
	ТекущаяСтрока = Элементы.ВидыСубконто.ТекущаяСтрока;
	ТиповыеОтчетыУХ.ДобавитьОтбор(Список_Аналитики.Отбор, "ТипОбъекта", ТекущаяСтрока);
	
КонецПроцедуры

&НаКлиенте
Процедура ВидыСубконтоПриАктивизацииСтроки(Элемент)
	
	УстановитьОтборПоВидуСубконто();
	
КонецПроцедуры

&НаКлиенте
Процедура Заполнить(Команда)
	
	Перем ТипОбъекта;
	
	Если Элементы.ОсновнаяПанель.ТекущаяСтраница.Имя = "Страница_Аналитики" Тогда
		ТипОбъекта = Элементы.ВидыСубконто.ТекущаяСтрока;
	Иначе
		ТипыЗначений.Свойство(Элементы.ОсновнаяПанель.ТекущаяСтраница.Имя, ТипОбъекта);
	КонецЕсли;
	
	ОткрытьФорму("РегистрСведений.ИменаФайловИКаталогов.Форма.ФормаЗаполненияИменФайловИКаталогов_Управляемая", Новый Структура("ТипОБъекта", ТипОБъекта));
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия="ИзмененыИменаФайловИКаталогов" Тогда
		
		ИмяСписка=СоответствиеСписковОбъектам.Получить(Параметр);
		
		Если Не ИмяСписка=Неопределено Тогда
			
			Элементы[ИмяСписка].Обновить();
			
		КонецЕсли;
				
	КонецЕсли;
	
КонецПроцедуры
